app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO `posts` (`title`, `content`, `created_at`, `updated_at`) VALUES ('Test', x'5468697320697320612074657374', '2017-01-28 03:34:43', '2017-01-28 03:34:43')